const config = {
    mode: "in", // 签到:in,签退:out
    accounts: [
        {
            username: "", //用户名
            // password: "", //密码（暂不支持）
            openId: "", //微信小程序抓包openid(暂时必选)
            unionId: "", //微信小程序抓包unionId(暂时必选)
            sign: false, //是否自动签到
            reSign: false, //是否重新签到
            location: "", //经纬度 (可选),例如 "120.210792,30.246026"、"经度,纬度",不填写则自动获取（推荐）
            // signImagePath: "./images/1.jpeg", //签到图片
            needReport: false, //是否自动填写周报
        },
        // 添加多个账户
        // {
        //   username: "",
        //   password: "",
        //   openId: "",
        //   unionId: "",
        //   sign: true, //是否自动签到
        //   reSign: true, //是否重新签到
        //   signImagePath: "./images/1.jpeg", //签到图片
        //   needReport: false, //是否自动填写周报
        // },
    ],
    qmsgKey: "", //qmsg酱key
    qmsgTo: "", //推送的qq号,用,分隔(可选)
    mail: {
        switch: false, //是否开启邮件推送
        host: "", //邮箱服务器
        port: 465, //邮箱端口
        secure: true, //是否使用SSL
        user: "", //邮箱用户名
        pass: "", //邮箱密码
        from: "", //发件人邮箱
        to: "", //收件人邮箱
        subject: "[校友邦-每日签到]", //邮件主题
        text: "", //邮件正文
        html: "", //邮件html内容
    },
    cron: "* * * * * *" // CRON 表达式，默认为单次运行
};

const modeCN = {
    in: "签到",
    out: "签退",
};
config.modeCN = modeCN[config.mode];

const apis = {
    login: "login/login.action",
    loginWX: "login/login!wx.action",
    accountInfo: "account/LoadAccountInfo.action",
    projects: "student/progress/ProjectList.action",
    tasks: "student/progress/ProjectProgressInfo.action",
    //周报
    weekBlogStatus: "student/blog/Plan!getDefault.action",
    weekReportsDate: "student/blog/LoadBlogDate!weekYear.action",
    weekReports: "student/blog/LoadBlogDate!week.action",
    weelBlogSave: "student/blog/Blog!save.action",
    weelBlogSubmit: "student/blog/Blog!getSubmitData.action",
    //签到
    clockDefault: "student/clock/GetPlan!getDefault.action", //planId => traineeId
    clockDetail: "student/clock/GetPlan!detail.action", //traineeId => postInfo
    clock: "student/clock/Post!autoClock.action", //首次签到
    clockNew: "student/clock/PostNew.action", //重新签到或签退
    // clockUpdate: "student/clock/PostNew!updateClock.action", //更新最近的签到/签退记录，已有签退记录时无法更新之前的签到记录
    clockUpdate: "student/clock/Post!updateClock.action", // reClock
    // clockNew: "student/clock/Post!autoClock.action", //临时接口
    // clockUpdate: "student/clock/postTemporary!updateClock.action", // reClock 临时接口
    //上传
    uploadInfo: "uploadfile/commonPostPolicy.action", //oss info
    uploadFile: "https://xyb001.oss-cn-hangzhou.aliyuncs.com/",
    duration: "behavior/Duration.action",
    ip: "behavior/Duration!getIp.action",
    // 地图api
    map: "https://restapi.amap.com/v3/geocode/regeo",
};

const reports = [
    [
        `  本周是我实习的第二周，初来乍到，我心中充满了迷茫与忐忑对未来的憧憬与对新环境的好奇，就这样我的实习生活开始了。
          在这两周的实习生活中，我了解到了公司的运作方式和团队的文化氛围，也逐渐熟悉了公司的业务流程和沟通方式。团队之间的合作和协调让我深刻地感受到了团队的方量和重要性。
          其次，我在实习的过程中积累了一定的工作经验和技能。通过参与项目和任务，我学会了如何高效地组织时间、协调资源和解决问题。在与同事合作的过程中，我也学会了如何有效地沟通和协调，以及如何克服困难和挑战。
          同时我也意识到了自己的不足和需要改进的地方。在与同事的交流中，他们对我的工作提出了一些宝贵的建议和意见，帮助我发现了自己的盲点和不足之处。我会认真对待这些建议，努力改进自己的工作和能力。
          在这两周的实习中，我不仅学到了很多专业知识和技能，还结识了许多优秀的同事和朋友。我相信，在接下来的实习生涯中，我会继续努力学习和进步，为公司的发展和自己的成长贡献自己的力量，总的来说，两周的实习经历充满了挑战和收获，我会珍惜这次宝贵的经历，维续努力学习和成长`
    ],
    [
        `经过两周的实习，我逐渐对工作环境和日常任务骂轻就熟，够独立完成一些基础性工作。初入职场的体验虽未如预想股艰难，却也少了校园里的那份自在与随性，提醒我作为实习生需更加严谨细致。实习如同一场深刻的历练，只有亲身经历过后才能领悟其中的真谛。学校中学习到的理论知识虽为基石，但与实际操作中的灵活多变相比，还是有很多不同。每天的工作就像开启新篇章，充满未知与挑战，这让我对后续的实习更是满怀期待。`,
        `同时我也意识到，在人际交往与自我管理方面，我尚存不足，还需要继续努力。我坚信，通过不懈努力与自我调整，这些问题终将化为成长的阶梯。我将以坚定的信名，积极面对并克服这些挑战，不断精进自我。我的目标是成为更加优秀的自己，不仅要在专业技能上有所建树，更要在人际交往与自律能力上实现飞跃，努力成为对社会有所贡献的人才。我将始终保持这份决心，向着既定目标奋勇前行，不懈奋斗。`,
        `.                                                                               .`
    ],
    [
        `本周是我实习的第六周，经过这将近一个月的实习，我已经完全熟悉了工作内容，也适应了这里的工作环境，和同事相处的也更加融洽了，每天都过的很充实。但是我需要提升的地方还有很多很多，从一开始对工作的盲目和无助到现在我自己可以主动合理的给自己安排一些简单的工作，感觉自己真的成长了很多，最最重要的是我学会了一些为人处世的道理和很多新的知识。随着学习的东西越来越多需要我去负责的内容也在不断增多，想要做的越来越好就需要我付出更多的时间去努方学习，遇到的困难也是大量的增加，有时候会感到很累，但是想要好每一个工作都是不容易的，没有容易的工作岗位等着你，我们必须调整好心态努力向前，慢慢成长，一步一个脚印的努力前进，我相信我会成长起来的，我感用我努力换取成功！`,
        `要保持积极向上的心态，面对困难不退缩，保持最好状态，努力工作，稳步前行，成为更加完美的自己！`,
        `.                                            .`
    ],
    [
        `时光如梭，一晃两周的时间又过去了，在这的每一天都让我感到很充实，这段时间让我感受最深刻的就是，理论知识和现实实践真的是不一样的，在学校上课的时候。书本上的知识都是死板的，到了现实生活中就不能直接套用了，需要我们灵活的运用，和实践相结合当时觉得上班是很轻松简单的，工作是按部就班没有闲难的，但是真正的来到岗位实习我发现，当时的想法真的是太天真可笑了，看着同事们每天忙碌但并然有序的身影，我发现，想要做好一份工作，真的不是想象的那么简单容易的。我真的很佩服同事们忙而有序的工作状态，把时问安排的明明白白。一天的工作节奏把握的很好，很多事都发生的没有预兆的，不是什么都能控制在自己的预想中，但在同事前辈那感觉就是轻而易举!我要认真的学习她们的工作模式和处理问题的方式方法。我相信，只要在这段难得的实习阶段中，我能认真的去学习做好每一件事，学习每个同事身上的闪光点，我也会成长为职场中闪光的一名。下周我会以更加饱满的精神努力工作！`
    ],
    [
        `不知不觉已经是实习的第十周了，过去的两个多月以来，与同事相处的更为融治了，也学会了怎样更好的做好工作，总结工作经验懂得把学习到的新思想跟实际相结合并得以运用,做出成效。平常里会向有经验的同事学习，并且在同事的帮助下，做一些简单的事情虽说事件简单，可不为小觑，每一件小事都是至关重要的，因为它们都是环环相扣，互相影响的，所以在工作方面要更加谨慎，为了保证最后的成功，每一步都要非常仔细。时刻警自己，要保持心，多向周围优秀的同事学习，鞭策自己，不断进步。在工作中要做到绝对认真，负责到底。为了可以真正锻炼自己和为以后走向社会打下坚定的基础，必须要严格要求自己，认真完成工作。`,
        `在实习期间我清楚地感到了地感到了自己肩上的重任，看清了自己的人生方向，也让我认识到了工作中应该有仔细认真的工作态度要有一种平和的心态和求知的精神，不管遇到什么事都要总代表地去思考，多听别人的建议，不要太过急燥。这周就是这样，接下来我会继续不断的学习总结，在这过程中积累经验。`
    ],
    [
        `这周的工作量不是很大，但是我每天都过得很充实，每天的工作虽然都很简单、枯燥，但我也在不断的接触新的事物，不仅能帮助我快速的成长，还能提高我独立思考问题以及遇到问题的对应能力。遇到困难和问题，不再像从前一样只知道寻找别人的帮助，而是够自已游刃有余的解决问题。我认为实习这门课程是非常有必要的，它不仅能馈炼我多方面的不足，还能为我以后步入社会打下坚实的基础实习的这段时问里，我的收获是方方面面的，在这里学习到了许多以前在学校没有学习过的专业知识和理论知识应用的方式，而且还大大的提高了自己的动手能力，还懂得了很多为人处世方面的道理。这次实习是对我能力的一种锻炼，更是一种考验。从中获得的诸多经验都是特别可贵的。这是一个让我能够做到把书本上学的理论知识与实践相结合的的好机会。这个实习能够激发我各个方面的潜力，提高了我的综合素质能力。`,
        `学无止境，学习的道路还很漫长，要不断的努力学习，奋斗向前才能走的更稳，走的更远。`
    ],
    [
        `不知不觉中就实习了这么久了,各个方面的工作都开始慢慢的悉起来了，跟同事们的相处更融治了，每天休息时听着她们给我讲开心的事，工作也没那么无聊。原以为实习的日子会非常的枯燥乏味，但适应下来发现实习的生活还是比较轻松愉悦的。有时候觉得时间过得很慢，但时间又总在忙碌中不知不觉的过去了，实习生活虽然辛苦但有很多收获，经过这么长的时间已经步入了实习生活的正轨，工作和生活习惯上都已经慢慢的适应了。`,
        `这些天工作做起来相比于上两周要轻松一些，因为我已经差不多全部掌握了每天的工作流程，和同事们一起工作也很有默契，她们上有很多值得我学习的东西。这些天里我很认真的和同事求教，认真观察记录她们处理问题的方式，学习方法和经验。在实习的过程中有很多事情是我不懂的，有些事情也是我没经历过的，不知道怎么决定，要向经验丰富的前辈多请教，学习她们的处理经验，取长度短，努力提高我自己的工作能力。`,
        `下周维续努力，路漫漫其修运兮，普将上下而求索。`
    ],
    [
        `时间过得可真快，一转眼的功夫两周的时间又过去了，我的变化很大，从一开始的抵触，迷茫，面对工作的手足无措，到现在的对所有工作都能偿到有条不乱，我深感积累经验的重要性。遇到问题和阴难时，我不再条件性的想要逃避，而是能够主动的面对困难，挑战困难，解决困难，尽心尽力的把工作做到极致，家人和同事们的鼓励让我更加充满动力。使我在实习的过程中拥有着源源不断的力量。`,
        `我非常珍惜这次难得的实习机会，实习的本质是为了能够更好的进入未来的工作岗位，实习中所学到的专业知识的灵活运用，为人处世方面的方式方法，目积月累的经验都是非常宝贵的。这次实习，让我学到了很多学校里学不到的尔西，想要成为一个优秀的职场工作者，需要具备扎实牢靠的知识基础，和在实践中能够灵活应对突发状况的能力。所以我要更加努力的去学习，充实自己的理论知识，锻炼自己在实践中的应用能力，使自己更加的坚毅，让自己的未来更加精彩！`
    ],
    [
        `转眼间十八周就这么过去了，从慢慢习惯了这里工作的生活后，时间好像要比之前过的快了一些，刚开始的时候感觉每天过得都好慢啊，心里很浮躁，每天想的都是怎么还不下班，想要快一些结束这无算的实习生活，现在确觉得这样的生活也蛮不错的，每天过得都很充实，感觉每天都很有意义，对生活充满了期待。当时觉得很难熬的日子，在忙忙碌碌中其实很快就过去了，工作虽然很辛苦，但是每天过的都很有意义，也学到了很多知识充实自己，甚至还让我养成了良好的生活习惯，每天工作的很累，下班国家早早就睡了，这还潜在的改掉了我在学校时养成的熬夜不早睡的坏习惯。`,
        `要趁着这难得的实习机会，要敢于面对挑战，故于试错，尝试是成功的第一步，敢于摸索，让自己身经百炼，把知识成熟运用于实践操作。只有通过不断地努力积累经验，在发展自己的不足时，及时的弥补不足，实实在在的提升自己，才能在今后的职场中应对自如。`
    ],
];

module.exports = { config, apis, reports };
